Revit.Elements.Material.#ctor(Autodesk.Revit.DB.Material)
Private constructor for DSMaterial
material:

Revit.Elements.Material.InitMaterial(Autodesk.Revit.DB.Material)
Initialize a Material element
material:

Revit.Elements.Material.InternalSetMaterial(Autodesk.Revit.DB.Material)
Set the internal Element, ELementId, and UniqueId
material:

Revit.Elements.Material.ByName(System.String)
Select a material from the current document by the name
name: The name of the material
Returns:

Revit.Elements.Material.FromExisting(Autodesk.Revit.DB.Material,System.Boolean)
Wrap an element in the associated DS type
material: The material
isRevitOwned:
Returns:

Revit.Elements.Material.InternalMaterial
Internal reference to the Element

Revit.Elements.Material.InternalElement
Reference to the Element